public class Temperature {
    /*9. Напишите класс Temperature, который имеет два поля: значение температуры (double) и символ шкалы, либо 'C' для Цельсия, либо 'F' для Фаренгейта. Убедитесь, что доступ к этим двум полям возможен только через методы-аксессоры (get/set) вне класса.

        Конструкторы:
        Класс должен иметь четыре конструктора:
        один для каждого поля экземпляра (предположим, ноль градусов, если значение не указано, и Цельсий, если шкала не указана)
        один с двумя параметрами для двух переменных экземпляра
        конструктор по умолчанию (устанавливается на ноль градусов Цельсия).

        Методы:
        Два метода для возврата температуры: один для возврата градусов по Цельсию, другой для возврата градусов по Фаренгейту.
        Для преобразования используйте следующие формулы:
        degreesC = 5(degreesF - 32) / 9
        degreesF = (9(degreesC/5) + 32

        Три метода для установки полей: один для установки значения, один для установки шкалы ('F' или 'C'), и один для установки обоих.
        Метод для возврата шкалы.
     */
}
